clc;clear;
%零件1.2的检测成本
a=2; b=3;
%零件1.2的单价
a1=4; b1=18;
%成品的组装费用和检测成本
c=6; d=3;
%不合格成品调换、拆解费用和售价
e=6; f=5; g=56;
%假设零件1.2初始数量
n=100;
%估计次品率的置信区间
p=(0.0875:0.0025:0.1525);
for p=(0.0875:0.0025:0.1525)
%   风险的计算公式
    S=n*0.8*(1-p)*(g+f)+n*0.2*(1-(1-p))*(1-p)*(e+f+a1+b1+c+d);
%     方案1 的成本，纯利润和k值
    A=n*(a+b)+n*p*(a1+b1)+n*(1-p)*(c+d)+n*(p-p*p)*(a1+b1);
    A1=n*(1-p)*(1-p)*(g-a1-b1)-A;
    k=S/(5*A1);
%     方案2 的成本，纯利润和k值
%     B=n*(a+b)+n*p*(a1+b1)+n*(1-p)*c+n*(p-p*p)*(e+f+a1+b1)+n*(p-p*p)*(a1+b1+c+d);
%     B1=n*(1-p)*(g-a1-b1)-B;
%     k=S/(5*B1);
%     方案3 的成本，纯利润和k值
%     h=3*p-3*p*p+p*p*p;
%     C=n*(c+d)+n*(a1+b1)*h;
%     C1=n*(1-p)*(1-p)*(1-p)*(g-a1-b1)-C;
%     k=S/(5*C1);
%     方案4 的成本，纯利润和k值
%     h=3*p-3*p*p+p*p*p;
%     D=n*c+n*(e+f+a1+b1)*h+n*(a1+b1+c+d)*h;
%     D1=n*(g-a1-b1)-D ;
%     k=S/(5*D1);
    disp(k)
end
